posts/homelab_network.html
<!DOCTYPE html><html><head><!-- 2025-12-31 --><!-- 2026-01-29 Thu 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cheap way to isolate devices in home network</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
Network isolation for vulnerable devices in home
</p>

<div id="outline-container-org8f2811d" class="outline-2">
<h2 id="org8f2811d">Smart TV</h2>
<div class="outline-text-2" id="text-org8f2811d">
<ul class="org-ul">
<li>I my case it uses intranet to stream video and cast video from phone.</li>
<li>I can assign static ip address to smart tv and Access Control / Parental Controls: Create a rule to Block Internet Access for that specific IP.
<ul class="org-ul">
<li>I tried Parental controls to disable internet for a particular device but it also cann't access intranet.</li>
</ul></li>
<li>I can allow when needed to install app or stream something in it.</li>
</ul>
</div>
</div>

<div id="outline-container-org9fd195e" class="outline-2">
<h2 id="org9fd195e">IOT devices</h2>
<div class="outline-text-2" id="text-org9fd195e">
<ul class="org-ul">
<li>Enable guest network</li>
<li>The Isolation: In your router settings, look for a checkbox that says "Allow guests to see each other" or "Access Intranet/Local Network." Make sure these are OFF.</li>
<li>If you consume only content from internet for TV use this network.</li>
<li>If you use DIY IOT devices and use local api then connect it to the main wifi access point</li>
</ul>
</div>
</div>

<div id="outline-container-org1ac4474" class="outline-2">
<h2 id="org1ac4474">Homelab server</h2>
<div class="outline-text-2" id="text-org1ac4474">
<ul class="org-ul">
<li>Assign static ip address based on Mac</li>
<li>For ease of use, you can assosiate free duckdns domain to it.</li>
<li>Why ? Getting SSL certificates for local server it pretty easy this way</li>
<li>I have personally tried caddy, i have seen people did it using ngnix proxy manager.</li>
<li>If you want to secure further, you can access it through tailscale and map the tailscale ip to the duckdns domain.</li>
</ul>
</div>
</div>

<div id="outline-container-org9647d87" class="outline-2">
<h2 id="org9647d87">Personal devices</h2>
<div class="outline-text-2" id="text-org9647d87">
<ul class="org-ul">
<li>Your phone, laptops are connected to normal wifi access point</li>
<li>Your phone cann't access IOT devices (i haven't verified it yet)</li>
</ul>
</div>
</div>

<div id="outline-container-org8d0fb64" class="outline-2">
<h2 id="org8d0fb64">Changelog</h2>
<div class="outline-text-2" id="text-org8d0fb64">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-01-10 Sat&gt; </span></span> added few points in all sections.</li>
</ul>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
